#+AUTHOR: Ertale81
#+TITLE: Python Crash course


* Class
When you write a class, you define the general behavior that a whole category of object can have. When you create individual objects from the class, each object is automatically equipped with the general behavior; you can then give each object what ever unique trait you desire.
Making an object from class is called /instantiation/, and you work with /instance/ of the class.
By convention capitalized names indicate *classes* in python.
The __init__ () method is a special method that python runs automatically whenever we create a new instance based class.

Think of class as a set of instructions for how to make an instance.
#+begin_src python :results output
  class Dog:
      def __init__(self,name,age):
          self.name = name
          self.age = age
      def sit(self):
          print(f"{self.name} is sitting")
      def rollover(self):
          print(f"{self.name} is rolling")
  my_dog = Dog("Walice", 8)
  print(f"My dog's name is = {my_dog.name} and age = {my_dog.age}")
  my_dog.sit()
  my_dog.rollover()

#+end_src

#+RESULTS:
: My dog's name is = Walice and age = 8
: Walice is sitting
: Walice is rolling

Dot notation uses to find attribute's value. Like my_ dog.name
To call a method, give the name of instance and the method you want to call separated by a dot.
You can create as many instances as you like from the class.

* Files and exceptions
When you want to work with the information in a text file, the first step is to read the file into memory. You can then work through all the file's content at once or work through the contents line by line.
#+begin_src python :results value output
  from pathlib import Path
  path = Path("pi_million_digits.txt")
  contents = path.read_text()
  lines = contents.splitlines()
  pi_string = ''
  for line in lines:
      pi_string += line.strip()
  print(f"{pi_string[:50]} ...")
  print(len(pi_string))
#+end_src

#+RESULTS:
: 3.141592653589793238462643383279502884197169399375 ...
: 1000002



To work with contents of a file, we need to tell python the path to the file. A /path/ is the exact location of a file or folder on a system.
There are two ways to give a path:
1) Relative path - When you pass a simple file name like /pi_ digits.py/ to Path, Python looks in the directory where the file that is currently being executed (that is your /.py/ program file) is stored.
   - looks for a given location relative to the directory where the current running program is stored.
     e.g: path = Path("text-file/file.txt")
2) Absolute path - when the file you want to open is not in the same directory as your program file.
   Absolute paths are usually longer than relative paths, because they start at your system's root folder
   e.g: path = Path("/home/admin/datafiles/path1.txt")
   
When Python reads from a file, it interprets all the text in the file as a string. If you read in a number and want to work with that value as numerical context, you will have to convert it to an integer using the /int()/ function or float(/float()/) function.

*** Writing Multiple lines
To write more than one line to a file, you need to build a string containing the entire contents of the file, and the call write_ text() with that string.
#+begin_src python :results output
  from pathlib import Path
  contents = "I love programming \n"
  contents += "I love creating new games\n"
  contents += "I also love working with data."
  path = Path("programming.txt")
  path.write_text(contents)
  print(path.read_text())
#+end_src

#+RESULTS:
: I love programming 
: I love creating new games
: I also love working with data.

** Exceptions
Python uses special objects called /exceptions/ to manage errors that arise during program's execution. Whenever an error occurs that makes python unsure of what to do next, it creates an exception object. If you write a code that handles the exception, the program will continue running. If you don't handle the exception, the program will halt and show a /traceback/ which includes the report of the exception that war raised.
Exceptions are handled with /try-except/ block. A /try-except/ block asks python to do something, but it also tells python what to do if an exception is raised.
When you use /try-except/ block, your program will continue running even if things start to go wrong.
#+begin_src python :results output
  try:
      print(50/0)
  except ZeroDivisionError:
      print("Can't divide by zero")
  print("Program continues after an exception\\smiley")

#+end_src

If the code in the /try/ block works, Python skips over the /except/ block. If the code in the /try/ block causes an error, Python looks for an except block whose error matches the one that was raised and runs the code in that block.

The only code that should go in a /try/ block is code that might cause an exception to be raised. Sometimes you'll have additional code that should run only if the /try/ block was successful; this code goes to the /else/ block.
The /except/ block tells python what to do in case a certain exception arises 

#+begin_src python :results output
  from pathlib import Path
  path = Path("file not found.txt")
  randtext = "Here is another file with for try except block\n"
  randtext += "Another line of text\n"
  #path.write_text(randtext)

  try:
      contents = path.read_text(encoding='utf-8')
  except FileNotFoundError:
      print("File was not found \\sad")

  else:
      for content in contents.splitlines():
          print(content)
#+end_src

#+RESULTS:
: File was not found \sad

*** json.dumps() and json.loads()
The json.dumps() function takes one argument: a piece of data that should be converted to the JSON format. The function returns a string which we can then write to a data file.
#+begin_src python :results output
  from pathlib import Path
  import json
  numbers = [0, 1, 1, 2, 3, 5, 8, 13, 21]
  path = Path("numbers.json")
  contents = json.dumps(numbers)
  path.write_text(contents)
  print(contents)
#+end_src
#+begin_src python :results output
  from pathlib import Path
  import json

  path = Path("numbers.json")
  contents = path.read_text()
  numbers = json.loads(contents)
  print(numbers)
#+end_src

#+RESULTS:
: [0, 1, 1, 2, 3, 5, 8, 13, 21]

The json.loads() function takes /JSON/-formatted string and returns a python object which we can assign to another variables.

